gap> 
gap> ## affine_join.g
gap> ag := AffineSpace(4,5);
AG(4, 5)
gap> p := AffineSubspace(ag, [1,0,0,0] * One(GF(5)) );
<a point in AG(4, 5)>
gap> r := AffineSubspace(ag, [0,1,0,0] * One(GF(5)) );
<a point in AG(4, 5)>
gap> l := Span(p, r);
<a line in AG(4, 5)>
gap> l^_;
[ <cvec over GF(5,1) of length 4>, <cmat 1x4 over GF(5,1)> ]
gap> Display(l);
Affine line:
Coset representative: NewRowVector(IsCVecRep,GF(5,1),[0*Z(5),Z(5)^0,0*Z(5),
0*Z(5),])
Coset (direction): NewMatrix(IsCMatRep,GF(5,1),4,[
[ Z(5)^0, Z(5)^2, 0*Z(5), 0*Z(5) ],])
gap> quit;
