gap> 
gap> #isometry groups of polar space
gap> ps := SymplecticSpace(3,4);
W(3, 4)
gap> IsometryGroup(ps);
PSp(4,4)
gap> ps := HyperbolicQuadric(5,8);
Q+(5, 8)
gap> IsometryGroup(ps);
PGO(1,6,8)
gap> ps := EllipticQuadric(3,27);
Q-(3, 27)
gap> IsometryGroup(ps);
PGO(-1,4,27)
gap> ps := ParabolicQuadric(4,8);
Q(4, 8)
gap> IsometryGroup(ps);
PGO(0,5,8)
gap> ps := HermitianPolarSpace(4,9);
H(4, 3^2)
gap> IsometryGroup(ps);
PGU(5,3^2)
gap> quit;
