gap> 
gap> #not Flag Transitive geometry example
gap> g:=SymmetricGroup(4);
Sym( [ 1 .. 4 ] )
gap> g1:=Subgroup(g,[(1,2,3)]);
Group([ (1,2,3) ])
gap> g2:=Subgroup(g,[(1,4)]);
Group([ (1,4) ])
gap> g3:=Subgroup(g,[(1,2,3,4)]);
Group([ (1,2,3,4) ])
gap> cg:=CosetGeometry(g,[g1,g2,g3]);
CosetGeometry( SymmetricGroup( [ 1 .. 4 ] ) )
gap> IsFlagTransitiveGeometry(cg);
false
gap> cg2:=CosetGeometry(g,[g1,g2]);
CosetGeometry( SymmetricGroup( [ 1 .. 4 ] ) )
gap> IsFlagTransitiveGeometry(cg2);
true
gap> quit;
