gap> 
gap> # Diagram/Random example
gap> g:=SymmetricGroup(5);
Sym( [ 1 .. 5 ] )
gap> g1:=Stabilizer(g,[1,2],OnSets);
Group([ (4,5), (3,5), (1,2)(4,5) ])
gap> g2:=Stabilizer(g,[[1,2],[3,4]],OnSetsSets);
Group([ (1,2), (3,4), (1,3)(2,4) ])
gap> cg:=CosetGeometry(g,[g1,g2]);
CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) )
gap> RandomElement(cg);
<element of type 1 of CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) )>
gap> Display(last);
RightCoset(Group( [ (4,5), (3,5), (1,2)(4,5) ] ),(1,4,2,5,3))
gap> RandomFlag(cg);
<Flag of coset geometry < CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) , 
[ Group( [ (4,5), (3,5), (1,2)(4,5) ] ), 
  Group( [ (1,2), (3,4), (1,3)(2,4) ] ) ] ) >>
gap> flg:=RandomFlag(cg);
<Flag of coset geometry < CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) , 
[ Group( [ (4,5), (3,5), (1,2)(4,5) ] ), 
  Group( [ (1,2), (3,4), (1,3)(2,4) ] ) ] ) >>
gap> Type(flg);
[ 1 ]
gap> flg2:=RandomFlag(cg);
<Flag of coset geometry < CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) , 
[ Group( [ (4,5), (3,5), (1,2)(4,5) ] ), 
  Group( [ (1,2), (3,4), (1,3)(2,4) ] ) ] ) >>
gap> Type(flg2);
[ 2 ]
gap> IsChamberOfIncidenceStructure(flg2);
false
gap> IsChamberOfIncidenceStructure(flg);
false
gap> Display(flg2);
Flag of coset geometry CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) , 
[ Group( [ (4,5), (3,5), (1,2)(4,5) ] ), 
  Group( [ (1,2), (3,4), (1,3)(2,4) ] ) ] ) with elements 
[ RightCoset(Group( [ (1,2), (3,4), (1,3)(2,4) ] ),(2,3,5)) ]
gap> cham:=RandomChamber(cg);
<Flag of coset geometry < CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) , 
[ Group( [ (4,5), (3,5), (1,2)(4,5) ] ), 
  Group( [ (1,2), (3,4), (1,3)(2,4) ] ) ] ) >>
gap> IsChamberOfIncidenceStructure(cham);
true
gap> ElementsOfFlag(cham);
[ <element of type 1 of CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) )>, 
  <element of type 2 of CosetGeometry( SymmetricGroup( [ 1 .. 5 ] ) )> ]
gap> IsIncident(last[1],last[2]);
true
gap> quit;
