gap> 
gap> #A nice near octagon
gap> LoadPackage("atlasrep");
true
gap> j2:=AtlasGroup("J2"); #Uses AtlasRep package
<permutation group of size 604800 with 2 generators>
gap> max3:=AtlasSubgroup(j2,3); #member of 3rd ATLAS class of max. subgps
<permutation group of size 1920 with 2 generators>
gap> max4:=AtlasSubgroup(j2,4); #member of 4th ATLAS class of max. subgps
<permutation group of size 1152 with 2 generators>
gap> conj3:=ConjugacyClassSubgroups(j2,max3);;
gap> g1:=First(conj3, c -> Size(Intersection(c,max4))=384);;
gap> g2:=max4;;
gap> cg:=CosetGeometry(j2,[g1,g2]);;
gap> Rank2Parameters(cg);
[ [ 6, 8, 8 ], [ 2, 315 ], [ 4, 525 ] ]
gap> quit;
