gap> 
gap> # examples_pg24.g
gap> pg := ProjectiveSpace(2, 4);
ProjectiveSpace(2, 4)
gap> points := Points( pg );
<points of ProjectiveSpace(2, 4)>
gap> pointslist := AsList( points );
[ <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)>, <a point in ProjectiveSpace(2, 4)>, 
  <a point in ProjectiveSpace(2, 4)> ]
gap> Display( pointslist[1] );
 . . 1
gap> quit;
