gap> 
gap> # examples_spreads.g
gap> w := SymplecticSpace(5, 3);
W(5, 3)
gap> g := IsometryGroup(w);
PSp(6,3)
gap> syl := SylowSubgroup(g, 13);
<projective collineation group of size 13>
gap> planes := Planes( w );
<planes of W(5, 3)>
gap> points := Points( w );
<points of W(5, 3)>
gap> orbs := Orbits(syl, planes , OnProjSubspaces);;
gap> IsPartialSpread := x -> Number(points, p ->
>          ForAny(x, i-> p in i)) = Size(x)*13;;
gap> partialspreads := Filtered(orbs, IsPartialSpread);;
gap> Length(partialspreads);
8
gap> 13s := Filtered(partialspreads, i -> Size(i) = 13);;
gap> Length(13s);
6
gap> 13s[1];
[ <a plane in W(5, 3)>, <a plane in W(5, 3)>, <a plane in W(5, 3)>, 
  <a plane in W(5, 3)>, <a plane in W(5, 3)>, <a plane in W(5, 3)>, 
  <a plane in W(5, 3)>, <a plane in W(5, 3)>, <a plane in W(5, 3)>, 
  <a plane in W(5, 3)>, <a plane in W(5, 3)>, <a plane in W(5, 3)>, 
  <a plane in W(5, 3)> ]
gap> 26s := List(Combinations(13s,2), Union);;
gap> two := Union(Filtered(partialspreads, i -> Size(i) = 1));;
gap> good26s := Filtered(26s, x->IsPartialSpread(Union(x, two)));;
gap> spreads := List(good26s, x->Union(x, two));;
gap> Length(spreads);
5
gap> quit;
