gap> 
gap> # intertwiner
gap> mat1 := IdentityMat(4,GF(16));
[ [ Z(2)^0, 0*Z(2), 0*Z(2), 0*Z(2) ], [ 0*Z(2), Z(2)^0, 0*Z(2), 0*Z(2) ], 
  [ 0*Z(2), 0*Z(2), Z(2)^0, 0*Z(2) ], [ 0*Z(2), 0*Z(2), 0*Z(2), Z(2)^0 ] ]
gap> form1 := HermitianFormByMatrix(mat1,GF(16));
< hermitian form >
gap> ps1 := PolarSpace(form1);
<polar space in ProjectiveSpace(3,GF(2^4)): x_1^5+x_2^5+x_3^5+x_4^5=0 >
gap> mat2 := [[0,1,0,0],[1,0,0,0],[0,0,0,1],[0,0,1,0]]*Z(16)^0;
[ [ 0*Z(2), Z(2)^0, 0*Z(2), 0*Z(2) ], [ Z(2)^0, 0*Z(2), 0*Z(2), 0*Z(2) ], 
  [ 0*Z(2), 0*Z(2), 0*Z(2), Z(2)^0 ], [ 0*Z(2), 0*Z(2), Z(2)^0, 0*Z(2) ] ]
gap> form2 := HermitianFormByMatrix(mat2,GF(16));
< hermitian form >
gap> ps2 := PolarSpace(form2);
<polar space in ProjectiveSpace(
3,GF(2^4)): x_1^4*x_2+x_1*x_2^4+x_3^4*x_4+x_3*x_4^4=0 >
gap> CollineationGroup(ps1);
#I  Computing collineation group of canonical polar space...
<projective collineation group of size 4073472000 with 3 generators>
gap> map := IsomorphismPolarSpaces(ps1,ps2);
<geometry morphism from <Elements of H(3, 
4^2): x_1^5+x_2^5+x_3^5+x_4^5=0> to <Elements of H(3, 
4^2): x_1^4*x_2+x_1*x_2^4+x_3^4*x_4+x_3*x_4^4=0>>
gap> phi := Intertwiner(map);
MappingByFunction( <projective collineation group of size 4073472000 with 
3 generators>, <projective collineation group of size 4073472000 with 
3 generators>, function( y ) ... end, function( x ) ... end )
gap> g := Random(CollineationGroup(ps1));
< a collineation: <cmat 4x4 over GF(2,4)>, F^4>
gap> h := g^phi;
< a collineation: <cmat 4x4 over GF(2,4)>, F^4>
gap> h in CollineationGroup(ps2);
#I  Computing collineation group of canonical polar space...
true
gap> h := Random(CollineationGroup(ps2));
< a collineation: <cmat 4x4 over GF(2,4)>, F^2>
gap> g := PreImageElm(phi,h);
< a collineation: <cmat 4x4 over GF(2,4)>, F^2>
gap> g in CollineationGroup(ps1);
true
gap> quit;
