gap> 
gap> # embedding by field reduction
gap> pg1 := PG(1,3^2);
ProjectiveSpace(1, 9)
gap> pg2 := PG(3,3);
ProjectiveSpace(3, 3)
gap> em := NaturalEmbeddingByFieldReduction(pg1,pg2);
<geometry morphism from <All elements of ProjectiveSpace(1, 
9)> to <All elements of ProjectiveSpace(3, 3)>>
gap> spread := List(Points(pg1),x->x^em);
[ <a line in ProjectiveSpace(3, 3)>, <a line in ProjectiveSpace(3, 3)>, 
  <a line in ProjectiveSpace(3, 3)>, <a line in ProjectiveSpace(3, 3)>, 
  <a line in ProjectiveSpace(3, 3)>, <a line in ProjectiveSpace(3, 3)>, 
  <a line in ProjectiveSpace(3, 3)>, <a line in ProjectiveSpace(3, 3)>, 
  <a line in ProjectiveSpace(3, 3)>, <a line in ProjectiveSpace(3, 3)> ]
gap> Union(List(spread,x->List(Points(x))))=Set(Points(pg2));
true
gap> ps1 := HermitianPolarSpace(3,3^2);
H(3, 3^2)
gap> ps2 := HyperbolicQuadric(7,3);
Q+(7, 3)
gap> em := NaturalEmbeddingByFieldReduction(ps1,ps2);
#I  These polar spaces are suitable for field reduction
<geometry morphism from <Elements of H(3, 3^2)> to <Elements of Q+(7, 3)>>
gap> spread := List(Points(ps1),x->x^em);;
gap> Union(List(spread,x->List(Points(x))))=Set(Points(ps2));
true
gap> quit;
