gap> 
gap> # Philippe's awesome E6 example
gap> L := SimpleLieAlgebra("E",6,Rationals);
<Lie algebra of dimension 78 over Rationals>
gap> rs := RootSystem(L);
<root system of rank 6>
gap> w := WeylGroup(rs);
<matrix group with 6 generators>
gap> gens := GeneratorsOfGroup(w);;
gap> pabs := List(gens, g -> Group(Difference(gens, [g])));
[ <matrix group with 5 generators>, <matrix group with 5 generators>, 
  <matrix group with 5 generators>, <matrix group with 5 generators>, 
  <matrix group with 5 generators>, <matrix group with 5 generators> ]
gap> g := Group(gens);
<matrix group with 6 generators>
gap> cg := CosetGeometry(g,pabs);;
gap> diag := DiagramOfGeometry( cg );;
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
#I Using NiceMonomorphism...
gap> DrawDiagram(diag, "E6");
gap> #Exec("open E6.ps");
gap> quit;
