gap> 
gap> #elation group of an EGQ by Kantor
gap> g := ElementaryAbelianGroup(27);
<pc group of size 27 with 3 generators>
gap> flist1 := [ Group(g.1), Group(g.2), Group(g.3), Group(g.1*g.2*g.3) ];;
gap> flist2 := [ Group([g.1, g.2^2*g.3]), Group([g.2, g.1^2*g.3 ]),
>             Group([g.3, g.1^2*g.2]), Group([g.1^2*g.2, g.1^2*g.3 ]) ];;
gap> egq := EGQByKantorFamily(g, flist1, flist2);
<EGQ of order [ 3, 3 ] and basepoint 0>
gap> group := ElationGroup(egq);
<pc group of size 27 with 3 generators>
gap> CollineationAction(group) = OnKantorFamily;
true
gap> l := ObjectToElement(egq,RightCoset(flist1[1],One(g)));
<a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>
gap> stab := Stabilizer(group,l,OnKantorFamily);
Group([ f1 ])
gap> pts := List(Points(egq));
[ <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a point of class 3 of <EGQ of order [ 3, 3 ] and basepoint 0>> ]
gap> Orbits(group,pts,OnKantorFamily);
[ [ <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a point of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a point of class 3 of <EGQ of order [ 3, 3 ] and basepoint 0>> ] ]
gap> lines := List(Lines(egq));
[ <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
  <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ]
gap> Orbits(group,lines,OnKantorFamily);
[ [ <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>>, 
      <a line of class 1 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ], 
  [ <a line of class 2 of <EGQ of order [ 3, 3 ] and basepoint 0>> ] ]
gap> quit;
