gap> 
gap> #order of a GP
gap> gp := TwistedTrialityHexagon(2^3);
T(8, 2)
gap> Order(gp);
[ 8, 2 ]
gap> gp := HermitianPolarSpace(4,25);
H(4, 5^2)
gap> Order(gp);
[ 25, 125 ]
gap> gp := EGQByqClan(LinearqClan(3));
#I  Computed Kantor family. Now computing EGQ...
<EGQ of order [ 9, 3 ] and basepoint 0>
gap> Order(gp);
[ 9, 3 ]
gap> quit;
