gap> 
gap> # incidence with flags
gap> pg := PG(3,5);
ProjectiveSpace(3, 5)
gap> p := Random(Points(pg));
<a point in ProjectiveSpace(3, 5)>
gap> l := Random(Lines(p));
<a line in ProjectiveSpace(3, 5)>
gap> plane := Random(Planes(l));
<a plane in ProjectiveSpace(3, 5)>
gap> flag := FlagOfIncidenceStructure(pg,[l,plane]);
<a flag of ProjectiveSpace(3, 5)>
gap> IsIncident(flag,l);
true
gap> IsIncident(l,flag);
true
gap> quit;
