gap> 
gap> #constructing standardduality of projective space
gap> ps := ProjectiveSpace(4,5);
ProjectiveSpace(4, 5)
gap> delta := StandardDualityOfProjectiveSpace(ps);
StandardDuality( AllElementsOfIncidenceStructure( ProjectiveSpace(4,GF(5)) ) )
gap> delta^2;
IdentityMapping( <All elements of ProjectiveSpace(4, 5)> )
gap> p := VectorSpaceToElement(ps,[1,2,3,0,1]*Z(5)^0);
<a point in ProjectiveSpace(4, 5)>
gap> h := p^delta;
<a solid in ProjectiveSpace(4, 5)>
gap> UnderlyingObject(h);
<cmat 4x5 over GF(5,1)>
gap> Unpack(last);
[ [ Z(5)^0, 0*Z(5), 0*Z(5), 0*Z(5), Z(5)^2 ], 
  [ 0*Z(5), Z(5)^0, 0*Z(5), 0*Z(5), Z(5)^3 ], 
  [ 0*Z(5), 0*Z(5), Z(5)^0, 0*Z(5), Z(5) ], 
  [ 0*Z(5), 0*Z(5), 0*Z(5), Z(5)^0, 0*Z(5) ] ]
gap> quit;
