gap> 
gap> #similarity groups of polar space
gap> ps := SymplecticSpace(3,4);
eq is zero
W(3, 4)
gap> CollineationGroup(ps);
#I  Computing nice monomorphism...
PGammaSp(4,4)
gap> ps := HyperbolicQuadric(5,8);
standard Q+(5, 8)
gap> CollineationGroup(ps);
#I  Computing nice monomorphism...
PGammaO+(6,8)
gap> ps := EllipticQuadric(3,27);
standard Q-(3, 27)
gap> CollineationGroup(ps);
#I  Computing nice monomorphism...
PGammaO-(4,27)
gap> ps := ParabolicQuadric(4,8);
Q(4, 8)
gap> CollineationGroup(ps);
#I  Computing nice monomorphism...
PGammaO(5,8)
gap> ps := HermitianVariety(4,9);
H(4, 3^2)
gap> CollineationGroup(ps);
#I  Computing nice monomorphism...
PGammaU(5,3^2)
gap> quit;
