gap> 
gap> #isometry groups of polar space
gap> ps := SymplecticSpace(3,4);
eq is zero
W(3, 4)
gap> IsometryGroup(ps);
#I  Computing nice monomorphism...
PSp(4,4)
gap> ps := HyperbolicQuadric(5,8);
standard Q+(5, 8)
gap> IsometryGroup(ps);
#I  Computing nice monomorphism...
PGO(1,6,8)
gap> ps := EllipticQuadric(3,27);
standard Q-(3, 27)
gap> IsometryGroup(ps);
#I  Computing nice monomorphism...
PGO(-1,4,27)
gap> ps := ParabolicQuadric(4,8);
Q(4, 8)
gap> IsometryGroup(ps);
#I  Computing nice monomorphism...
PGO(0,5,8)
gap> ps := HermitianVariety(4,9);
H(4, 3^2)
gap> IsometryGroup(ps);
#I  Computing nice monomorphism...
PGU(5,3^2)
gap> quit;
