gap> 
gap> # points of varieties
gap> F:=GF(9);
GF(3^2)
gap> r:=PolynomialRing(F,4);
GF(3^2)[x_1,x_2,x_3,x_4]
gap> pg:=PG(3,9);
ProjectiveSpace(3, 9)
gap> f1:=r.1*r.3-r.2^2;
x_1*x_3-x_2^2
gap> f2:=r.4*r.1^2-r.4^3;
x_1^2*x_4-x_4^3
gap> var:=AlgebraicVariety(pg,[f1,f2]);
Projective Variety in ProjectiveSpace(3, 9)
gap> points:=Points(var);
<points of Projective Variety in ProjectiveSpace(3, 9)>
gap> Size(points);
28
gap> iter := Iterator(points);
<iterator>
gap> for i in [1..4] do
> 	x := NextIterator(iter);
> 	Display(x);
> od;
[1...]
[1..1]
[1..2]
[111.]
gap> quit;
